README.md
```mermaid
flowchart LR
  subgraph Grafana
    direction LR
    CP -- notifies --> OnCall
    subgraph Alerting
      CP[Contact Point]
    end
    subgraph OnCall
      direction TB
      IN[Grafana Integration] -- triggers --> EC[Escalation Chain]
      EC -- step --> N[Notification]
      N -- fetches OnCall user from --> Schedule
    end
  end
```
